# i = 1

# while i <= 10:
#     i += 1

# print(i)
# ////////////////////////////////////////////////////////////////////////////////////////
# i = 10

# while i >= 0:
#     print(i)
#     i -= 1


# ////////////////////////////////////////////////////////////////////////////////////////

# n = int(input("Введите число: "))
# i = 1

# while i <= n:
#     print(i)
#     i += 1
# ///////////////////////////////////////////////////////////////////////////////////////////////

# n = int(input("Введите число: "))
# i = 1

# while i <= n:
#     if i % 2 == 0:
#         print(i)
#     i += 1
# ////////////////////////////////////////////////////////////////////////////////////////////

# i = 1
# total = 0

# while i <= 100:
#     total += i
#     i += 1

# print(total)
# //////////////////////////////////////////////////////////////////////////////////////////////

# n = int(input("Введите число: "))
# i = 1
# total = 0

# while i <= n:
#     total += i
#     i += 1

# print(total)
# //////////////////////////////////////////////////////////////////////////////////////////////////
# n = int(input("Введите число: "))
# i = 1

# while i <= 10:
#     print(f"{n} x {i} = {n * i}")
#     i += 1
# //////////////////////////////////////////////////////////////////////////////////////////////////

# password = input("Введите пароль: ")

# while password != "python":
#     password = input("Еще раз: ")

# print("Пароль принят!")
# ///////////////////////////////////////////////////////////////////////////////////////////////////


# num = int(input("Введите число: "))
# count = 0

# if num == 0:
#     count = 1
# else:
#     if num < 0:
#         num = -num  # меняем знак на + (- на - = +)

#     while num > 0:
#         count += 1
#         num //= 10

# print("Количество цифр:", count)
# ///////////////////////////////////////////////////////////////////////////////////////////////////

# total = 0
# num = int(input("Введите число: "))

# while num != 0:
#     total += num
#     num = int(input("Введите число: "))
#     print(total)

# print("Сумма:", total)
# //////////////////////////////////////////////////////////////////////////////////////////////
# 1
# word = "иладеп"
# print(word[::-1])
# 2
# word = "иладеп"

# drow = ""
# index = len(word) - 1
# while index >= 0:
#     drow += word[index]
#     index -= 1
# print(drow)
# 3
# word = "иладеп"

# index = len(word) - 1
# while index > -1:
#     print(word[index], end="")
#     index -= 1
# else:
#     print()  # в конце перенести строку в терминале
# /////////////////////////////////////////////////////////////////////////////////////////

# text = input("Введите текст: ")
# symbol = input("Введите символ который по краям фрагмента текста: ")

# start_index = text.index(symbol) + 1  # индекс начала получили

# new_text = ""
# while start_index < len(text):
#     char = text[start_index]  # берем символ из текста
#     if char == symbol:  # когда встретился "второй" символ то всё.
#         break
#     new_text += char
#     start_index += 1

# print(new_text)
# # ИЛИ только срезами. Внимательно с индексами и промежуточной строкой.
# text = input("Введите текст: ")
# symbol = input("Введите символ который по краям фрагмента текста: ")

# start = text.index(symbol) + 1  # индекс начала получили

# # давайте сразу срежем с этого момента до конца текста:
# part = text[start:]  # срез с start до конца

# stop = part.index(symbol)  # получаем индекс второго вхождения symbol

# result = text[start : stop + start]
# # или
# result = part[:stop]

# print(result)
# /////////////////////////////////////////////////////////////////////////////
# text = "ступеньки"

# index = 0
# while index < len(text):
#     # метод строк rjust добавляет до нужной длины слева то что вы указали в нем
#     char = text[index]
#     for_print = char.rjust(index + 1, "_")
#     print(for_print)
#     index += 1

# text = text[::-1]
# index = 0
# while index < len(text):
#     for_print = text[index].rjust(len(text) - index, " ")
#     for_print2 = text[index].rjust(-index + len(text), " ")
#     print(for_print, for_print2)
#     index += 1
# /////////////////////////////////////////////////////////////////////////////////
punctuation = "!@#$%^&./,?|"
text = "Наверно на этом упражнении закончим. Хватит! Мы хотим отдыхать! #@&#@&!!!"


new_text = ""

idx = 0
while idx < len(text):
    char = text[idx]
    if char not in punctuation:
        new_text += char
    idx += 1
else:
    text = text.strip()  # почистим от пробелов по бокам. Только по бокам.

print(new_text)
