# 1 exe
# text = input("Введите строку: ")

# if len(text) > 10:
#     print(text[0], text[-1])
# else:
#     print("Строка слишком короткая")
# ///////////////////////////////////////////////////////////////////////////////////////////
# 2 exe
# text = input("Введите строку: ")

# if text[0] == "A" or text[0] == "a":
#     print("Начинается с A")
# else:
#     print("Начинается с другой буквы")
# ////////////////////////////////////////////////////////////////////////////////////////

# 3 exe

# text = input("Введите строку: ")

# if len(text) > 8:
#     print(text[0:4])
# else:
#     print(text)
# //////////////////////////////////////////////////////////////////////////////////////


# 4 exe
# text = input("Введите сообщение: ")
# if len(text) > 6 and text[-1] == "!":
#     print("Эмоциональное сообщение")
# else:
#     print("Обычное сообщение")
# /////////////////////////////////////////////////////////////////////////////////////////

# exe 5
# text = input("Введите строку: ")
# if "@" in text or "#" in text:
#     print("Спецсимвол найден")
# else:
#     print("Спецсимволов нет")
# ........................................................................

# exe 6

# name = input("Введите имя: ")
# surname = input("Введите фамилию: ")


# if name and surname:
#     print(f"Привет, {name} {surname}")
# else:
#     print("Введите корректные данные")
# //////////////////////////////////////////////////////////////////////////////////////////////////

# exe 7
# text = input("Введите строку: ")

# if len(text) > 10:
#     print(f"{text[0:8]}")
# else:
#     print("Недостаточно символов")
# ///////////////////////////////////////////////////////////////////////////////////

# exe 8


# text = input("Введите строку: ")

# if text:
#     print(f"Первый символ: {text[0]}, последний символ: {text[-1]}")
# else:
#     print("Пустая строка")
# ////////////////////////////////////////////////////////////////////////////////////

# exe 9
# text = input("Введите строку: ")
# if 5 <= len(text) <= 10:
#     print("Подходящая длина")
# else:
#     print("Неподходящая длина")

# ///////////////////////////////////////////////////////////////////////////////////

# exe 10
# text = input("Введите строку: ")
# if text.startswith("Py") or text.endswith("on"):
#     print("Похоже на Python")
# else:
#     print("Не похоже на Python")
# /////////////////////////////////////////////////////////////////////////////////////

# exe 11
text = input("Введите фразу: ")
if text.lower() == "привет":
    print("И тебе Привет!")
elif text.lower() == "пока":
    print("Адьос!")
